In [6]:
import pandas as pd

# Q1. List any five functions of the pandas library with execution.

In [7]:
url_data=pd.read_html("https://github.com/datasciencedojo/datasets/blob/master/titanic.csv")

In [8]:
df=url_data[0]

### Head function

In [9]:
df.head()

,Unnamed: 0,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,NaN,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,NaN,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,NaN,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,NaN,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,NaN,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

### Drop function

In [10]:
df.drop(columns=['Unnamed: 0'],inplace=True)

### DropNa function

In [12]:
df.dropna(inplace=True)

### Describe Function

In [13]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,183.000000,183.000000,183.000000,183.000000,183.000000,183.000000,183.000000
mean,455.366120,0.672131,1.191257,35.674426,0.464481,0.475410,78.682469
std,247.052476,0.470725,0.515187,15.643866,0.644159,0.754617,76.347843
min,2.000000,0.000000,1.000000,0.920000,0.000000,0.000000,0.000000
25%,263.500000,0.000000,1.000000,24.000000,0.000000,0.000000,29.700000
50%,457.000000,1.000000,1.000000,36.000000,0.000000,0.000000,57.000000
75%,676.000000,1.000000,1.000000,47.500000,1.000000,1.000000,90.000000
max,890.000000,1.000000,3.000000,80.000000,3.000000,4.000000,512.329200

### Dtypes function

In [14]:
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

# Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [18]:
data={'A':[1,2,3,4],'B':[1,2,3,4],'C':[1,2,3,4]}

In [19]:
df=pd.DataFrame(data)

In [20]:
df

   A  B  C
0  1  1  1
1  2  2  2
2  3  3  3
3  4  4  4

In [32]:
newidx = [i for i in range (1,8,2)]

In [33]:
newidx

[1, 3, 5, 7]

In [34]:
newdf=df.reindex(newidx)

In [35]:
newdf

     A    B    C
1  2.0  2.0  2.0
3  4.0  4.0  4.0
5  NaN  NaN  NaN
7  NaN  NaN  NaN

# Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The function should print the sum to the console.

In [36]:
data={'Values':[1,2,3,4,5,6,7]}
df=pd.DataFrame(data)

In [37]:
df

   Values
0       1
1       2
2       3
3       4
4       5
5       6
6       7

In [49]:
sum=0
for index,row in df.iterrows():
    if(index<3):
        sum=sum+row['Values']
    else:
        break
print(sum)

6

# Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column 'Word_Count' that contains the number of words in each row of the 'Text' column.

In [170]:
data={'Text':['how are you','pw skills','Data Science Course']}
df=pd.DataFrame(data)

In [171]:
df

                  Text
0          how are you
1            pw skills
2  Data Science Course

In [172]:
df['Word_count']='NULL'   #adding a column first

for index,row in df.iterrows():
    c=1
    s=row['Text']
    
    for i in s:
        if(i==' '):
            c=c+1
            
   
    df['Word_count'][index]=c

In [173]:
df

                  Text Word_count
0          how are you          3
1            pw skills          2
2  Data Science Course          3

# Q5. How are DataFrame.size() and DataFrame.shape() different?

Dataframe.shape() gives the number of rows and columns

In [74]:
df.shape

(3, 2)

Dataframe.size() gives the rows * columns

In [76]:
df.size

6

# Q6. Which function of pandas do we use to read an excel file?

pd.read_excel() function is used to read excel file

# Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email addresses in the format 'username@domain.com'. Write a Python function that creates a new column 'Username' in df that contains only the username part of each email address.

In [160]:
data={'Email':['abcd@gmail.com','kanishk@gmail.com','pwskills@gmail.com']}

In [161]:
df=pd.DataFrame(data)

In [162]:
df

                Email
0      abcd@gmail.com
1   kanishk@gmail.com
2  pwskills@gmail.com

In [167]:
df['username']='NULL'   #adding a column first 
for index,row in df.iterrows():
    
    s=row['Email']
    st=''
    for i in s:
        
        if(i!='@'):
            st=st+i
        else:
            break
            
    df['username'][index]=st

In [168]:
df

                Email  username
0      abcd@gmail.com      abcd
1   kanishk@gmail.com   kanishk
2  pwskills@gmail.com  pwskills

# Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The function should return a new DataFrame that contains only the selected rows. For example, if df contains the following values:

A B C

0 3 5 1

1 8 2 7

2 6 9 4

3 2 3 5

4 9 1 2

In [174]:
data={'A':[3,8,6,2,9],'B':[5,2,9,3,1],'C':[1,7,4,5,2]}

In [175]:
df=pd.DataFrame(data)

In [177]:
df

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [180]:
df[(df['A']>5) & (df['B']<10)]

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

# Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,median, and standard deviation of the values in the 'Values' column.

In [184]:
data={'Values':[1,2,3,40,5,6,7,8]}
df=pd.DataFrame(data)

In [185]:
#mean
df['Values'].mean()

9.0

In [186]:
#median
df['Values'].median()

5.5

In [187]:
#standard deviation
df['Values'].std()

12.761549390929883

# Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days for each row in the DataFrame. The moving average should be calculated using a window of size 7 and should include the current day.

In [214]:
data={'date':['2023-01-01','2023-01-02','2023-01-03','2023-01-04','2023-01-05',
              '2023-01-06','2023-01-07','2023-01-08','2023-01-09','2023-01-10',
             '2023-01-11','2023-01-12','2023-01-13','2023-01-14','2023-01-15'],
     'sales':[1,2,3,4,5,6,7,8,9,9,9,10,11,12,13]}

In [215]:
df=pd.DataFrame(data)

In [216]:
df

          date  sales
0   2023-01-01      1
1   2023-01-02      2
2   2023-01-03      3
3   2023-01-04      4
4   2023-01-05      5
5   2023-01-06      6
6   2023-01-07      7
7   2023-01-08      8
8   2023-01-09      9
9   2023-01-10      9
10  2023-01-11      9
11  2023-01-12     10
12  2023-01-13     11
13  2023-01-14     12
14  2023-01-15     13

In [217]:
df['Average'] = df['sales'].rolling(7).mean()

In [218]:
df

          date  sales    Average
0   2023-01-01      1        NaN
1   2023-01-02      2        NaN
2   2023-01-03      3        NaN
3   2023-01-04      4        NaN
4   2023-01-05      5        NaN
5   2023-01-06      6        NaN
6   2023-01-07      7   4.000000
7   2023-01-08      8   5.000000
8   2023-01-09      9   6.000000
9   2023-01-10      9   6.857143
10  2023-01-11      9   7.571429
11  2023-01-12     10   8.285714
12  2023-01-13     11   9.000000
13  2023-01-14     12   9.714286
14  2023-01-15     13  10.428571

# Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g. Monday, Tuesday) corresponding to each date in the 'Date' column. For example, if df contains the following values:
Date

0 2023-01-01

1 2023-01-02

2 2023-01-03

3 2023-01-04

4 2023-01-05

In [235]:
 date=pd.date_range(start='1/1/2023', periods=5, freq='D')

In [236]:
date

DatetimeIndex(['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04',
               '2023-01-05'],
              dtype='datetime64[ns]', freq='D')

In [238]:
data={'Date':date}
df=pd.DataFrame(data)

In [239]:
df

        Date
0 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05

In [241]:
df['Weekday']=df['Date'].dt.day_name()

In [242]:
df

        Date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

# Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [243]:
date=pd.date_range(start='1/1/2023', periods=60, freq='D')

In [244]:
data={'Date':date}
df=pd.DataFrame(data)

In [245]:
df

         Date
0  2023-01-01
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05
5  2023-01-06
6  2023-01-07
7  2023-01-08
8  2023-01-09
9  2023-01-10
10 2023-01-11
11 2023-01-12
12 2023-01-13
13 2023-01-14
14 2023-01-15
15 2023-01-16
16 2023-01-17
17 2023-01-18
18 2023-01-19
19 2023-01-20
20 2023-01-21
21 2023-01-22
22 2023-01-23
23 2023-01-24
24 2023-01-25
25 2023-01-26
26 2023-01-27
27 2023-01-28
28 2023-01-29
29 2023-01-30
30 2023-01-31
31 2023-02-01
32 2023-02-02
33 2023-02-03
34 2023-02-04
35 2023-02-05
36 2023-02-06
37 2023-02-07
38 2023-02-08
39 2023-02-09
40 2023-02-10
41 2023-02-11
42 2023-02-12
43 2023-02-13
44 2023-02-14
45 2023-02-15
46 2023-02-16
47 2023-02-17
48 2023-02-18
49 2023-02-19
50 2023-02-20
51 2023-02-21
52 2023-02-22
53 2023-02-23
54 2023-02-24
55 2023-02-25
56 2023-02-26
57 2023-02-27
58 2023-02-28
59 2023-03-01

In [247]:
df[(df['Date']<='2023-01-31') & (df['Date']>='2023-01-01')]

         Date
0  2023-01-01
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05
5  2023-01-06
6  2023-01-07
7  2023-01-08
8  2023-01-09
9  2023-01-10
10 2023-01-11
11 2023-01-12
12 2023-01-13
13 2023-01-14
14 2023-01-15
15 2023-01-16
16 2023-01-17
17 2023-01-18
18 2023-01-19
19 2023-01-20
20 2023-01-21
21 2023-01-22
22 2023-01-23
23 2023-01-24
24 2023-01-25
25 2023-01-26
26 2023-01-27
27 2023-01-28
28 2023-01-29
29 2023-01-30
30 2023-01-31

# Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to be imported?

To use basic functions of pandas we need to import pandas

In [248]:
import pandas as pd